/***********************************************/
/* SST, NEDTEX & NEDTEL STATS DATA             */
/***********************************************/
SIGNAL ON ERROR
ADDRESS COMMAND

'CP SP CONS OPSMAINT START NAME DCMMIS LOAD'
/** LINK TO OPS DISK FOR RAW DCMMIS FILE **/
'CP LINK OPS 191 199 RR'
'ACCESS 199 B'
/** SPLIT RAW FILE INTO SQL DBSU FORMAT  **/
  'EXEC SPLITDCM'
/** SORT FILES**/
PUSH 5 10 14 19 21 30 32 39 41 50 52 59
'CASORT HDRDATA FILE A HDRDATA SORTFILE A'
PUSH 1 6 8 13 15 24 26 33 35 44 46 53 55 58
'CASORT ACTIVITY DATA A ACTIVITY SORTFILE A'

'EXEC DCMSQL'

/**
"EXEC SQLLOG W01 _LOADDCM_ SQLDCM__ DCM_____" **/
'CP LOGOFF'
EXIT RC

ERROR:
Say Sourceline(SIGL)
Say "gave return code" RC
Exit RC

